src/AccumulationRegisters/СтраховыеВзносыПереданныеВПФР/СтраховыеВзносыПереданныеВПФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтраховыеВзносыПереданныеВПФР</name>
  <resources>
    <name>Страховая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Накопительная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховаяЧленамЭкипажейМорскихСудов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НакопительнаяЧленамЭкипажейМорскихСудов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КатегорияЗастрахованныхЛиц</name>
    <type>
      <types>EnumRef.КатегорииЗастрахованныхЛицДляПФР</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоровСЗВ63</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗастрахованныхЛицУНФ</name>
    <type>
      <types>EnumRef.КатегорииЗастрахованныхЛицДляПФРУНФ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/СтраховыеВзносыПереданныеВПФР/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

//{{MRG[ <-> ]
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
// }}MRG[ <-> ]
// {{MRG[ <-> ]
//// Параметры:
// }}MRG[ <-> ]
// {{MRG[ <-> ]
////   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
////
//}}MRG[ <-> ]
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//{{MRG[ <-> ]
//
//}}MRG[ <-> ]
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
//{{MRG[ <-> ]
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	|	ЗначениеРазрешено(Организация)";
//
//}}MRG[ <-> ]
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда	
		Возврат;		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	СтраховыеВзносыПереданныеВПФР.НомерСтроки КАК НомерСтроки,
	|	СтраховыеВзносыПереданныеВПФР.ВидДвижения КАК ВидДвижения,
	|	СтраховыеВзносыПереданныеВПФР.Организация КАК Организация,
	|	СтраховыеВзносыПереданныеВПФР.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтраховыеВзносыПереданныеВПФР.КатегорияЗастрахованныхЛицУНФ КАК КатегорияЗастрахованныхЛиц,
	|	СтраховыеВзносыПереданныеВПФР.Страховая КАК СтраховаяПередЗаписью,
	|	СтраховыеВзносыПереданныеВПФР.Страховая КАК СтраховаяИзменение,
	|	СтраховыеВзносыПереданныеВПФР.Страховая КАК СтраховаяПриЗаписи,
	|	СтраховыеВзносыПереданныеВПФР.Накопительная КАК НакопительнаяПередЗаписью,
	|	СтраховыеВзносыПереданныеВПФР.Накопительная КАК НакопительнаяИзменение,
	|	СтраховыеВзносыПереданныеВПФР.Накопительная КАК НакопительнаяПриЗаписи
	|ПОМЕСТИТЬ ДвиженияСтраховыеВзносыПереданныеВПФРИзменение
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыПереданныеВПФР КАК СтраховыеВзносыПереданныеВПФР");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияСтраховыеВзносыПереданныеВПФРИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

//{{MRG[ <-> ]
#КонецЕсли
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//#КонецЕсли
//}}MRG[ <-> ]
